Autodesk.Revit.DB.IFC.IFCFile.CreateStyle(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.Color,Autodesk.Revit.DB.ElementId)
Creates and populates an IfcStyledItem for an IfcRepresentationItem with a IfcSurfaceStyle, IfcCurveStyle, and/or an IfcFillStyle,
and assigns them to the file.
exporterIFC:
The exporter.
repItem:
The representation item.
color:
The color.
fillPatternId:
The fill pattern id.
Returns:
The handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A transaction is required for this operation.
Since:
2013

Autodesk.Revit.DB.IFC.IFCFile.CreateStyle(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.IFC.IFCAnyHandle)
Creates and populates an IfcStyledItem for an IfcRepresentationItem with a IfcSurfaceStyle, IfcCurveStyle, and/or an IfcFillStyle,
and assigns them to the file.
exporterIFC:
The exporter.
repItem:
The representation item.
Returns:
The handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A transaction is required for this operation.
Since:
2012

Autodesk.Revit.DB.IFC.IFCFile.CreateCurveBoundedPlane(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList`1{System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ}})
Creates a handle representing an IfcCurveBoundedPlane and assigns it to the file.
outerLoop:
A set of points that represents the outer boundary.
innerLoops:
A collection of sets of points that represent inner loops.
Returns:
The handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A transaction is required for this operation.
Since:
2012

Autodesk.Revit.DB.IFC.IFCFile.GetInstanceCount(System.String,System.Boolean)
Counts IFC instances of one particular type.
entityName:
The name of the instance type.
includeSubTypes:
True to count instances of sub types.
Returns:
The count.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.IFC.IFCFile.GetInstances(System.String,System.Boolean)
Gets IFC instances of one particular type.
entityName:
The name of the instance type.
includeSubTypes:
True to retrieve instances of sub types.
Returns:
The instance handles.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.IFC.IFCFile.CreateHeaderInstance(System.String)
Creates an IFC header instance in the file model.
Remarks:
file_schema, file_description and file_name
must be created to get IFC file written successfully.
Otherwise, the output IFC file would be empty.
name:
The instance name.
Returns:
The instance handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCFile.CreateInstance(System.String)
Creates an IFC instance in the file model.
name:
The instance name.
Returns:
The instance handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCFile.Read(Autodesk.Revit.DB.IFC.IFCFileReadOptions,System.Int32@,System.Int32@)
Reads content from a file of IFC format.
readOptions:
The IFC file read options.
pNumErrors:
The number of errors reported during the read process.  The actual messages will be in the log file.
pNumWarnings:
The number of warnings reported during the read process.  The actual messages will be in the log file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Error reading opening model for unzipping.
Error reading IFC file.
Since:
2015

Autodesk.Revit.DB.IFC.IFCFile.Read(Autodesk.Revit.DB.IFC.IFCFileReadOptions)
Reads content from a file of IFC format.
readOptions:
The IFC file read options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.IFC.IFCFile.Write(Autodesk.Revit.DB.IFC.IFCFileWriteOptions)
Writes content to a file of IFC format.
writeOptions:
The IFC file write options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCFile.Create(Autodesk.Revit.DB.IFC.IFCFileModelOptions)
Creates an IFC file for exporting.
modelOptions:
The options.
Returns:
The IFC file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013